# Brews
brew "wget"
brew "mpv"
brew "ffmpeg"
brew "gh"
brew "git"
brew "grex"
brew "ical-buddy"
brew "libtool"
brew "yarn"

# Apps
cask "1password"
cask "abstract"
cask "arq"
cask "bartender"
cask "eagle"
cask "fantastical"
cask "figma"
cask "firefox"
cask "framer"
cask "github"
cask "hyper"
cask "imageoptim"
cask "kap"
cask "kindle"
cask "mailspring"
cask "night-owl"
cask "notion"
cask "ratcast"
cask "rectangle"
cask "skype"
cask "skype"
cask "slack"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inter"
cask "font-lato"
cask "font-source-sans-pro"

# App Store apps
mas "", id: 1365531024  "1Blocker"
mas "", id: 557168941   "Tweetbot"
mas "", id: 1532801185  "mymind"
mas "", id: 953286746   "Darkroom"
mas "", id: 409201541   "Pages"
mas "", id: 1054607607  "Helium"
mas "", id: 1474276998  "HP Smart"
mas "", id: 408981434   "iMovie"
mas "", id: 409203825   "Numbers"
mas "", id: 960276676   "Taurine"
mas "", id: 288545208   "Instapaper"
mas "", id: 409183694   "Keynote"
mas "", id: 775737590   "iA Writer"

# Remove brew cruft
brew cleanup

# Remove cask cruft
brew cask cleanup
