tap "homebrew/cask-fonts"

# Brews
brew "ffmpeg"
brew "gh"
brew "git"
brew "grex"
brew "ical-buddy"
brew "libtool"
brew "mas"
brew "mpv"
brew "wget"
brew "yarn"

# Apps
cask "1password"
cask "abstract"
cask "arq"
cask "bartender"
cask "eagle"
cask "fantastical"
cask "figma"
cask "firefox"
cask "framer"
cask "github"
cask "hyper"
cask "imageoptim"
cask "kap"
cask "kindle"
cask "mailspring"
cask "night-owl"
cask "notion"
cask "ratcast"
cask "rectangle"
cask "skype"
cask "skype"
cask "slack"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inter"
cask "font-lato"
cask "font-source-sans-pro"

# App Store apps
mas "1Blocker", id: 1365531024
mas "Tweetbot", id: 557168941
mas "mymind", id: 1532801185
mas "Darkroom", id: 953286746
mas "Pages", id: 409201541
mas "Helium", id: 1054607607
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Taurine", id: 960276676
mas "Instapaper", id: 288545208
mas "Keynote", id: 409183694
mas "iA Writer", id: 775737590

# Remove brew cruft
brew cleanup

# Remove cask cruft
brew cask cleanup
